# text = "slovo"
# for i in text:
#     print(i)


# text = "Hello"
# for i in range(5, 16):
#     print(i)

# money = int(input("Сколько денег: "))
# cash = int(input("Сколько вложите: "))
# days = int(input("Срок: "))
# for i in range(days):
#     money += cash
# print(money)

# cel = int(input("Сколько хотите накопить: "))
# days = 0
# while money < cel:
#     money += cash
#     days += 1
# print(money, days)

#Написать программу, которая считает сумму целых чисел от 1 до 20 (включительно).
# numbers = 0 #Сумма чисел
# for i in range(1, 21):
#     numbers = numbers + i
# print(numbers)

#Написать программу, которая считает сумму всех нечетных чисел от 0 до 10.
# numbers = 0
# for i in range(0, 11):
#     if i % 2 != 0:
#         numbers += i
# print(numbers)

#Напишите программу, которая выводит таблицу умножения для чисел от 1 до 10.
# for i in range(1, 11):
#     for j in range(1, 11):
#         print(f'{i} * {j} = {i * j}')
#     print("___________________________")

#Напишите программу, которая запрашивает у пользователя число n и
# вычисляет сумму всех чётных чисел от 1 до n.
# n = int(input("Введите число: "))
# num = 0
# for i in range(1, n + 1):
#     if i % 2 == 0:
#         num += i
# print(num)

# ????????? Напишите программу, в которой в бексонечном цикле пользователь вводит два числа,
# а программа выводит их сумму.
# Затем программа запрашивает, надо ли завершить ввод. И если пользователь вводит
# букву "Y" или "y", то происходит выход из бесконечного цикла, и программа завершается.
# При нажатии любой другой клавиши, программа продолжает работу.

# num_1 = int(input("Введите первое число: "))
# num_2 = int(input("Введите второе число: "))
# n = 0
# for i in num_1, num_2:
#     n = num_1 + num_2
# print(n)
#     num_1 = int(input("Введите первое число: "))
#     num_2 = int(input("Введите второе число: "))

















