# Сумма всех чисел от 1-100
# for i in range(1, 101):
#     print(sum(range(101)))
#     break

#Сумма всех Четных чисел от 1-100
# for i in range(1, 101):
#     print(sum(range(2, 101, 2)))
#     break

#Сумма всех не четных чисел от 1-100
# for i in range(1, 101):
#     print(sum(range(1, 101, 2)))
#     break

#Остаток от деления чисел
# a = int(input("Ввидите число: "))
# b = int(input("Введите число: "))
# print(a % b)

#Каждый 2ой элемент списка
# a = [1, 2, 3, 4, 5, 6]
# print(a[:6:2])

#Сумма всех элементов списка
# a =[1, 2, 3, 4, 5]
# print(sum(a[:5]))

